# ПРОВЕРКА ТАЙНИК:
#время на дорогу (туда/обратно)
travel_time = 60
#Проведение проверки
inspection = 30
#Изучение легенды
legend = 10
#Изучение чеклиста
checklist = 10
#Заполнение отчета
report = 30
#Сумма длительности
def calculate_duration():
    duration = ((inspection+legend+checklist+report)+ travel_time*0.5)/60
    return round (duration,2)

# ПРОВЕРКА КУРАТОР
#Длительность аудио  
audio_duration = 30
#Поиск тайника
find_cache = 120
#Сумма длительности
def check_curator ():
    duration = (audio_duration+find_cache)/60
    return round(duration,2)

# ЗАРАБОТНАЯ ПЛАТА 
salary_data = [
    {"region": "Алтайский край", "salary": 54329},
    {"region": "Амурская область", "salary": 87034},
    {"region": "Архангельская область", "salary": 85192},
    {"region": "Архангельская область без авт. округа", "salary": 80792},
    {"region": "Астраханская область", "salary": 61316},
    {"region": "Белгородская область", "salary": 65674},
    {"region": "Брянская область", "salary": 58240},
    {"region": "Ненецкий авт.округ", "salary": 134443},
    {"region": "Владимирская область", "salary": 63229},
    {"region": "Волгоградская область", "salary": 59407},
    {"region": "Вологодская область", "salary": 71467},
    {"region": "Воронежская область", "salary": 63275},
    {"region": "г. Москва", "salary": 100000},
    {"region": "г. Севастополь", "salary": 57863},
    {"region": "г. Санкт-Петербург", "salary": 108317},
    {"region": "Дальневосточный федеральный округ", "salary": 98328},
    {"region": "Еврейская авт.область", "salary": 77036},
    {"region": "Забайкальский край", "salary": 84989},
    {"region": "Ивановская область", "salary": 49479},
    {"region": "Иркутская область", "salary": 95000},
    {"region": "Кабардино-Балкарская Республика", "salary": 46808},
    {"region": "Калининградская область", "salary": 65725},
    {"region": "Калужская область", "salary": 72215},
    {"region": "Камчатский край", "salary": 132306},
    {"region": "Карачаево-Черкесская Республика", "salary": 47775},
    {"region": "Кемеровская область", "salary": 77582},
    {"region": "Кировская область", "salary": 57537},
    {"region": "Костромская область", "salary": 55770},
    {"region": "Краснодарский край", "salary": 67530},
    {"region": "Красноярский край", "salary": 93649},
    {"region": "Курганская область", "salary": 62643},
    {"region": "Курская область", "salary": 64413},
    {"region": "Ленинградская область", "salary": 80980},
    {"region": "Липецкая область", "salary": 66923},
    {"region": "Магаданская область", "salary": 153760},
    {"region": "Московская область", "salary": 98795},
    {"region": "Мурманская область", "salary": 113594},
    {"region": "Нижегородская область", "salary": 67004},
    {"region": "Новгородская область", "salary": 63870},
    {"region": "Новосибирская область", "salary": 75052},
    {"region": "Омская область", "salary": 64428},
    {"region": "Оренбургская область", "salary": 63582},
    {"region": "Орловская область", "salary": 55820},
    {"region": "Пензенская область", "salary": 57468},
    {"region": "Пермский край", "salary": 73292},
    {"region": "Приволжский федеральный округ", "salary": 66532},
    {"region": "Приморский край", "salary": 84907},
    {"region": "Псковская область", "salary": 54782},
    {"region": "Республика Адыгея", "salary": 55514},
    {"region": "Республика Алтай", "salary": 62075},
    {"region": "Республика Башкортостан", "salary": 67576},
    {"region": "Республика Бурятия", "salary": 72832},
    {"region": "Республика Дагестан", "salary": 44244},
    {"region": "Республика Ингушетия", "salary": 39964},
    {"region": "Республика Калмыкия", "salary": 48925},
    {"region": "Республика Карелия", "salary": 73774},
    {"region": "Республика Коми", "salary": 87640},
    {"region": "Республика Крым", "salary": 54436},
    {"region": "Республика Марий Эл", "salary": 59970},
    {"region": "Республика Мордовия", "salary": 57055},
    {"region": "Республика Саха (Якутия)", "salary": 125208},
    {"region": "Республика Северная Осетия - Алания", "salary": 47315},
    {"region": "Республика Татарстан", "salary": 75645},
    {"region": "Республика Тыва", "salary": 66838},
    {"region": "Республика Хакасия", "salary": 70527},
    {"region": "Ростовская область", "salary": 61925},
    {"region": "Рязанская область", "salary": 64009},
    {"region": "Самарская область", "salary": 67893},
    {"region": "Саратовская область", "salary": 58019},
    {"region": "Сахалинская область", "salary": 130642},
    {"region": "Свердловская область", "salary": 78493},
    {"region": "Северо-Западный федеральный округ", "salary": 93266},
    {"region": "Северо-Кавказский федеральный округ", "salary": 49285},
    {"region": "Сибирский федеральный округ", "salary": 76941},
    {"region": "Смоленская область", "salary": 58879},
    {"region": "Ставропольский край", "salary": 57131},
    {"region": "Тамбовская область", "salary": 54130},
    {"region": "Тверская область", "salary": 63800},
    {"region": "Томская область", "salary": 76700},
    {"region": "Тульская область", "salary": 72943},
    {"region": "Тюменская область", "salary": 121455},
    {"region": "Тюменская область без авт. округов", "salary": 83417},
    {"region": "Удмуртская Республика", "salary": 65759},
    {"region": "Ульяновская область", "salary": 59401},
    {"region": "Уральский федеральный округ", "salary": 91691},
    {"region": "Хабаровский край", "salary": 84722},
    {"region": "Ханты-Мансийский авт.округ - Югра", "salary": 124372},
    {"region": "Челябинская область", "salary": 70945},
    {"region": "Чеченская Республика", "salary": 41884},
    {"region": "Чувашская Республика", "salary": 60428},
    {"region": "Чукотский авт.округ", "salary": 184970},
    {"region": "Южный федеральный округ", "salary": 62291},
    {"region": "Ямало-Ненецкий авт.округ", "salary": 163881},
    {"region": "Ярославская область", "salary": 64566},
]